Tekla Open API Reference for Tekla Structures 2025
WeldMarkAttributes Properties
The WeldMark.WeldMarkAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
Font
 The weld mark font settings.
SeamAbove
 The visibility of the seam above parameters.
SeamBelow
 The visibility of the seam below parameters.
ShowEdgeAround
 Gets or sets visibility of the weld mark edge/around property.
ShowReferenceText
 Gets or sets visibility of the weld mark reference text.
ShowWeldNumber
 The visibility of the weld number.
ShowWorkshopSite
 Gets or sets visibility of the weld mark workshop/site property.
TransparentBackground
 Controls the text background transparency (transparent/opaque).
Top
See Also
Reference
WeldMark.WeldMarkAttributes Class
Tekla.Structures.Drawing Namespace